import streamlit as st

st.title("Познай столицата 🌍")

st.write("Здравей и добре дошъл във викторината ,,Познай столицата,,!")

name = st.text_input("Как се казваш?")

if name:
    st.write("Здравей,", name)

    score = 0

    st.write("-----")
    st.write("Въпрос 1: Коя е столицата на България?")
    answer1 = st.text_input("Твоят отговор:", key="1")

    if answer1:
        if answer1.lower() == "софия":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("❌ Абее", name, "столицата е София")

    st.write("Въпрос 2: Коя е столицата на Германия?")
    answer2 = st.text_input("Твоят отговор:", key="2")

    if answer2 != "":
        if answer2.lower() == "берлин":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("❌ Абее", name, "столицата е Берлин")

    st.write("Въпрос 3: Коя е столицата на Франция?")
    answer3 = st.text_input("Твоят отговор:", key="3")

    if answer3 != "":
        if answer3.lower() == "париж":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("❌", name, "столицата е Париж")

    st.write("Въпрос 4: Коя е столицата на Италия?")
    answer4 = st.text_input("Твоят отговор:", key="4")

    if answer4 != "":
        if answer4.lower() == "рим":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("❌ Абее", name, "столицата е Рим бе. Как можа това да го объркаш")

    st.write("Въпрос 5: Коя е столицата на Испания?")
    answer5 = st.text_input("Твоят отговор:", key="5")

    if answer5 != "":
        if answer5.lower() == "мадрид":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("Грешно ❌ Столицата е Мадрид")

    st.write("Въпрос 6: Коя е столицата на Гърция?")
    answer6 = st.text_input("Твоят отговор:", key="6")

    if answer6 != "":
        if answer6.lower() == "атина":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("❌ Абе", name, "ти ако това не знаеш тотогава какво знаеш? Столицата е Атина")

    st.write("Въпрос 7: Коя е столицата на Румъния?")
    answer7 = st.text_input("Твоят отговор:", key="7")

    if answer7 != "":
        if answer7.lower() == "букурещ":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("Грешно ❌ Столицата е Букурещ")

    st.write("Въпрос 8: Коя е столицата на Сърбия?")
    answer8 = st.text_input("Твоят отговор:", key="8")

    if answer8 != "":
        if answer8.lower() == "белград":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("Грешно ❌ Столицата е Белград")

    st.write("Въпрос 9: Коя е столицата на Англия?")
    answer9 = st.text_input("Твоят отговор:", key="9")

    if answer9 != "":
        if answer9.lower() == "лондон":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("Грешно ❌ Столицата е Лондон")

    st.write("Въпрос 10: Коя е столицата на Япония?")
    answer10 = st.text_input("Твоят отговор:", key="10")

    if answer10 != "":
        if answer10.lower() == "токио":
            st.write("Верен отговор! ✅")
            score = score + 1
        else:
            st.write("Грешно ❌ Столицата е Токио")

    if st.button("Краен резултат"):
        st.write("-----")
        st.write("Твоят резултат е:", score, "от 10")
